app/controllers/store_controller.rb

SELECT * FROM "products" ORDER BY title
---
  def index
    @product =Product.find_products_for_sale

SELECT * FROM "products" WHERE ("products"."id" = 5)
---
  def add_to_cart
    product=Product.find(params[:id])

INSERT INTO "line_items" ("created_at", "quantity", "updated_at", "order_id", "total_price", "product_id") VALUES('2013-06-11 06:11:12', 1, '2013-06-11 06:11:12', 2147021971, 1234.0, 1)
INSERT INTO "orders" ("email", "name", "created_at", "pay_type", "updated_at", "address") VALUES('test@yes.cn', 'Daves Tomas', '2013-06-11 06:11:12', 'check', '2013-06-11 06:11:12', 'test Address')
---
  def save_order
    @cart = find_cart
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save