app/controllers/users_controller.rb

  def index
    @users = User.find(:all, :order => :name)
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("salt", "updated_at", "hashed_password", "created_at", "name") VALUES('22743013400.155576374144646', '2013-06-07 13:56:05', '4851c7974515f0ce6e74ea907ea52ff9be1e4b2b', '2013-06-07 13:56:05', 'alex')

  def destroy
    @user = User.find(params[:id])
    begin
      flash[:notice] = "User #{@user.name} deleted"
      @user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
DELETE FROM "users" WHERE "id" = 1